zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f460-int-evt.h
/*
 * Copyright (C) 2024-2025, Xiaohua Semiconductor Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_INTERRUPT_CONTROLLER_HC32F460_INT_EVT_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_INTERRUPT_CONTROLLER_HC32F460_INT_EVT_H_


/**
 * @brief Interrupt Vector Number
 */
#define NonMaskableInt_IRQn             -14  /* Non Maskable                             */
#define HardFault_IRQn                  -13  /* Hard Fault                               */
#define MemoryManagement_IRQn           -12  /* MemManage Fault                          */
#define BusFault_IRQn                   -11  /* Bus Fault                                */
#define UsageFault_IRQn                 -10  /* Usage Fault                              */
#define SVCall_IRQn                     -5   /* SVCall                                   */
#define DebugMonitor_IRQn               -4   /* DebugMonitor                             */
#define PendSV_IRQn                     -2   /* Pend SV                                  */
#define SysTick_IRQn                    -1   /* System Tick                              */
#define INT000_IRQn                     0
#define INT001_IRQn                     1
#define INT002_IRQn                     2
#define INT003_IRQn                     3
#define INT004_IRQn                     4
#define INT005_IRQn                     5
#define INT006_IRQn                     6
#define INT007_IRQn                     7
#define INT008_IRQn                     8
#define INT009_IRQn                     9
#define INT010_IRQn                     10
#define INT011_IRQn                     11
#define INT012_IRQn                     12
#define INT013_IRQn                     13
#define INT014_IRQn                     14
#define INT015_IRQn                     15
#define INT016_IRQn                     16
#define INT017_IRQn                     17
#define INT018_IRQn                     18
#define INT019_IRQn                     19
#define INT020_IRQn                     20
#define INT021_IRQn                     21
#define INT022_IRQn                     22
#define INT023_IRQn                     23
#define INT024_IRQn                     24
#define INT025_IRQn                     25
#define INT026_IRQn                     26
#define INT027_IRQn                     27
#define INT028_IRQn                     28
#define INT029_IRQn                     29
#define INT030_IRQn                     30
#define INT031_IRQn                     31
#define INT032_IRQn                     32
#define INT033_IRQn                     33
#define INT034_IRQn                     34
#define INT035_IRQn                     35
#define INT036_IRQn                     36
#define INT037_IRQn                     37
#define INT038_IRQn                     38
#define INT039_IRQn                     39
#define INT040_IRQn                     40
#define INT041_IRQn                     41
#define INT042_IRQn                     42
#define INT043_IRQn                     43
#define INT044_IRQn                     44
#define INT045_IRQn                     45
#define INT046_IRQn                     46
#define INT047_IRQn                     47
#define INT048_IRQn                     48
#define INT049_IRQn                     49
#define INT050_IRQn                     50
#define INT051_IRQn                     51
#define INT052_IRQn                     52
#define INT053_IRQn                     53
#define INT054_IRQn                     54
#define INT055_IRQn                     55
#define INT056_IRQn                     56
#define INT057_IRQn                     57
#define INT058_IRQn                     58
#define INT059_IRQn                     59
#define INT060_IRQn                     60
#define INT061_IRQn                     61
#define INT062_IRQn                     62
#define INT063_IRQn                     63
#define INT064_IRQn                     64
#define INT065_IRQn                     65
#define INT066_IRQn                     66
#define INT067_IRQn                     67
#define INT068_IRQn                     68
#define INT069_IRQn                     69
#define INT070_IRQn                     70
#define INT071_IRQn                     71
#define INT072_IRQn                     72
#define INT073_IRQn                     73
#define INT074_IRQn                     74
#define INT075_IRQn                     75
#define INT076_IRQn                     76
#define INT077_IRQn                     77
#define INT078_IRQn                     78
#define INT079_IRQn                     79
#define INT080_IRQn                     80
#define INT081_IRQn                     81
#define INT082_IRQn                     82
#define INT083_IRQn                     83
#define INT084_IRQn                     84
#define INT085_IRQn                     85
#define INT086_IRQn                     86
#define INT087_IRQn                     87
#define INT088_IRQn                     88
#define INT089_IRQn                     89
#define INT090_IRQn                     90
#define INT091_IRQn                     91
#define INT092_IRQn                     92
#define INT093_IRQn                     93
#define INT094_IRQn                     94
#define INT095_IRQn                     95
#define INT096_IRQn                     96
#define INT097_IRQn                     97
#define INT098_IRQn                     98
#define INT099_IRQn                     99
#define INT100_IRQn                     100
#define INT101_IRQn                     101
#define INT102_IRQn                     102
#define INT103_IRQn                     103
#define INT104_IRQn                     104
#define INT105_IRQn                     105
#define INT106_IRQn                     106
#define INT107_IRQn                     107
#define INT108_IRQn                     108
#define INT109_IRQn                     109
#define INT110_IRQn                     110
#define INT111_IRQn                     111
#define INT112_IRQn                     112
#define INT113_IRQn                     113
#define INT114_IRQn                     114
#define INT115_IRQn                     115
#define INT116_IRQn                     116
#define INT117_IRQn                     117
#define INT118_IRQn                     118
#define INT119_IRQn                     119
#define INT120_IRQn                     120
#define INT121_IRQn                     121
#define INT122_IRQn                     122
#define INT123_IRQn                     123
#define INT124_IRQn                     124
#define INT125_IRQn                     125
#define INT126_IRQn                     126
#define INT127_IRQn                     127
#define INT128_IRQn                     128
#define INT129_IRQn                     129
#define INT130_IRQn                     130
#define INT131_IRQn                     131
#define INT132_IRQn                     132
#define INT133_IRQn                     133
#define INT134_IRQn                     134
#define INT135_IRQn                     135
#define INT136_IRQn                     136
#define INT137_IRQn                     137
#define INT138_IRQn                     138
#define INT139_IRQn                     139
#define INT140_IRQn                     140
#define INT141_IRQn                     141
#define INT142_IRQn                     142
#define INT143_IRQn                     143


/**
 * @brief Interrupt Priority Level
 */
#define DDL_IRQ_PRIO_00                 (0U)
#define DDL_IRQ_PRIO_01                 (1U)
#define DDL_IRQ_PRIO_02                 (2U)
#define DDL_IRQ_PRIO_03                 (3U)
#define DDL_IRQ_PRIO_04                 (4U)
#define DDL_IRQ_PRIO_05                 (5U)
#define DDL_IRQ_PRIO_06                 (6U)
#define DDL_IRQ_PRIO_07                 (7U)
#define DDL_IRQ_PRIO_08                 (8U)
#define DDL_IRQ_PRIO_09                 (9U)
#define DDL_IRQ_PRIO_10                 (10U)
#define DDL_IRQ_PRIO_11                 (11U)
#define DDL_IRQ_PRIO_12                 (12U)
#define DDL_IRQ_PRIO_13                 (13U)
#define DDL_IRQ_PRIO_14                 (14U)
// #define DDL_IRQ_PRIO_15                 (15U)   /* kernal used */

#define DDL_IRQ_PRIO_DEFAULT            (DDL_IRQ_PRIO_14)


/**
 * @brief Interrupt Source Number
 */
#define INT_SRC_SWI_IRQ0             0U       /* SWI_IRQ0  */
#define INT_SRC_SWI_IRQ1             1U       /* SWI_IRQ1  */
#define INT_SRC_SWI_IRQ2             2U       /* SWI_IRQ2  */
#define INT_SRC_SWI_IRQ3             3U       /* SWI_IRQ3  */
#define INT_SRC_SWI_IRQ4             4U       /* SWI_IRQ4  */
#define INT_SRC_SWI_IRQ5             5U       /* SWI_IRQ5  */
#define INT_SRC_SWI_IRQ6             6U       /* SWI_IRQ6  */
#define INT_SRC_SWI_IRQ7             7U       /* SWI_IRQ7  */
#define INT_SRC_SWI_IRQ8             8U       /* SWI_IRQ8  */
#define INT_SRC_SWI_IRQ9             9U       /* SWI_IRQ9  */
#define INT_SRC_SWI_IRQ10            10U      /* SWI_IRQ10 */
#define INT_SRC_SWI_IRQ11            11U      /* SWI_IRQ11 */
#define INT_SRC_SWI_IRQ12            12U      /* SWI_IRQ12 */
#define INT_SRC_SWI_IRQ13            13U      /* SWI_IRQ13 */
#define INT_SRC_SWI_IRQ14            14U      /* SWI_IRQ14 */
#define INT_SRC_SWI_IRQ15            15U      /* SWI_IRQ15 */
#define INT_SRC_SWI_IRQ16            16U      /* SWI_IRQ16 */
#define INT_SRC_SWI_IRQ17            17U      /* SWI_IRQ17 */
#define INT_SRC_SWI_IRQ18            18U      /* SWI_IRQ18 */
#define INT_SRC_SWI_IRQ19            19U      /* SWI_IRQ19 */
#define INT_SRC_SWI_IRQ20            20U      /* SWI_IRQ20 */
#define INT_SRC_SWI_IRQ21            21U      /* SWI_IRQ21 */
#define INT_SRC_SWI_IRQ22            22U      /* SWI_IRQ22 */
#define INT_SRC_SWI_IRQ23            23U      /* SWI_IRQ23 */
#define INT_SRC_SWI_IRQ24            24U      /* SWI_IRQ24 */
#define INT_SRC_SWI_IRQ25            25U      /* SWI_IRQ25 */
#define INT_SRC_SWI_IRQ26            26U      /* SWI_IRQ26 */
#define INT_SRC_SWI_IRQ27            27U      /* SWI_IRQ27 */
#define INT_SRC_SWI_IRQ28            28U      /* SWI_IRQ28 */
#define INT_SRC_SWI_IRQ29            29U      /* SWI_IRQ29 */
#define INT_SRC_SWI_IRQ30            30U      /* SWI_IRQ30 */
#define INT_SRC_SWI_IRQ31            31U      /* SWI_IRQ31 */

/* External Interrupt. */
#define INT_SRC_PORT_EIRQ0           0U       /* PORT_EIRQ0  */
#define INT_SRC_PORT_EIRQ1           1U       /* PORT_EIRQ1  */
#define INT_SRC_PORT_EIRQ2           2U       /* PORT_EIRQ2  */
#define INT_SRC_PORT_EIRQ3           3U       /* PORT_EIRQ3  */
#define INT_SRC_PORT_EIRQ4           4U       /* PORT_EIRQ4  */
#define INT_SRC_PORT_EIRQ5           5U       /* PORT_EIRQ5  */
#define INT_SRC_PORT_EIRQ6           6U       /* PORT_EIRQ6  */
#define INT_SRC_PORT_EIRQ7           7U       /* PORT_EIRQ7  */
#define INT_SRC_PORT_EIRQ8           8U       /* PORT_EIRQ8  */
#define INT_SRC_PORT_EIRQ9           9U       /* PORT_EIRQ9  */
#define INT_SRC_PORT_EIRQ10          10U      /* PORT_EIRQ10 */
#define INT_SRC_PORT_EIRQ11          11U      /* PORT_EIRQ11 */
#define INT_SRC_PORT_EIRQ12          12U      /* PORT_EIRQ12 */
#define INT_SRC_PORT_EIRQ13          13U      /* PORT_EIRQ13 */
#define INT_SRC_PORT_EIRQ14          14U      /* PORT_EIRQ14 */
#define INT_SRC_PORT_EIRQ15          15U      /* PORT_EIRQ15 */

/* DMAC */
#define INT_SRC_DMA1_TC0             32U      /* DMA1_TC0  */
#define INT_SRC_DMA1_TC1             33U      /* DMA1_TC1  */
#define INT_SRC_DMA1_TC2             34U      /* DMA1_TC2  */
#define INT_SRC_DMA1_TC3             35U      /* DMA1_TC3  */
#define INT_SRC_DMA2_TC0             36U      /* DMA2_TC0  */
#define INT_SRC_DMA2_TC1             37U      /* DMA2_TC1  */
#define INT_SRC_DMA2_TC2             38U      /* DMA2_TC2  */
#define INT_SRC_DMA2_TC3             39U      /* DMA2_TC3  */
#define INT_SRC_DMA1_BTC0            40U      /* DMA1_BTC0 */
#define INT_SRC_DMA1_BTC1            41U      /* DMA1_BTC1 */
#define INT_SRC_DMA1_BTC2            42U      /* DMA1_BTC2 */
#define INT_SRC_DMA1_BTC3            43U      /* DMA1_BTC3 */
#define INT_SRC_DMA2_BTC0            44U      /* DMA2_BTC0 */
#define INT_SRC_DMA2_BTC1            45U      /* DMA2_BTC1 */
#define INT_SRC_DMA2_BTC2            46U      /* DMA2_BTC2 */
#define INT_SRC_DMA2_BTC3            47U      /* DMA2_BTC3 */
#define INT_SRC_DMA1_ERR             48U      /* DMA1_ERR */
#define INT_SRC_DMA2_ERR             49U      /* DMA2_ERR */

/* EFM */
#define INT_SRC_EFM_PEERR            50U      /* EFM_PEERR */
#define INT_SRC_EFM_COLERR           51U      /* EFM_COLERR */
#define INT_SRC_EFM_OPTEND           52U      /* EFM_OPTEND */

/* QSPI */
#define INT_SRC_QSPI_INTR            54U      /* QSPI_INTR */

