zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f460-int-evt.h
/* DCU */
#define INT_SRC_DCU1                 55U      /* DCU1 */
#define INT_SRC_DCU2                 56U      /* DCU2 */
#define INT_SRC_DCU3                 57U      /* DCU3 */
#define INT_SRC_DCU4                 58U      /* DCU4 */

/* TIMER 0 */
#define INT_SRC_TMR0_1_CMP_A         64U      /* TMR01_GCMA */
#define INT_SRC_TMR0_1_CMP_B         65U      /* TMR01_GCMB */
#define INT_SRC_TMR0_2_CMP_A         66U      /* TMR02_GCMA */
#define INT_SRC_TMR0_2_CMP_B         67U      /* TMR02_GCMB */

/* RTC */
#define INT_SRC_RTC_ALM              81U      /* RTC_ALM */
#define INT_SRC_RTC_PRD              82U      /* RTC_PRD */

/* XTAL32 stop */
#define INT_SRC_XTAL32_STOP          84U      /* XTAL32_STOP */

/* XTAL stop */
#define INT_SRC_XTAL_STOP            85U      /* XTAL_STOP */

/* wake-up timer */
#define INT_SRC_WKTM_PRD             86U      /* WKTM_PRD */

/* SWDT */
#define INT_SRC_SWDT_REFUDF          87U      /* SWDT_REFUDF */

/* TIMER 6 */
#define INT_SRC_TMR6_1_GCMP_A        96U      /* TMR61_GCMA */
#define INT_SRC_TMR6_1_GCMP_B        97U      /* TMR61_GCMB */
#define INT_SRC_TMR6_1_GCMP_C        98U      /* TMR61_GCMC */
#define INT_SRC_TMR6_1_GCMP_D        99U      /* TMR61_GCMD */
#define INT_SRC_TMR6_1_GCMP_E        100U     /* TMR61_GCME */
#define INT_SRC_TMR6_1_GCMP_F        101U     /* TMR61_GCMF */
#define INT_SRC_TMR6_1_OVF           102U     /* TMR61_GOVF */
#define INT_SRC_TMR6_1_UDF           103U     /* TMR61_GUDF */
#define INT_SRC_TMR6_1_DTE           104U     /* TMR61_GDTE */
#define INT_SRC_TMR6_1_SCMP_A        107U     /* TMR61_SCMA */
#define INT_SRC_TMR6_1_SCMP_B        108U     /* TMR61_SCMB */
#define INT_SRC_TMR6_2_GCMP_A        112U     /* TMR62_GCMA */
#define INT_SRC_TMR6_2_GCMP_B        113U     /* TMR62_GCMB */
#define INT_SRC_TMR6_2_GCMP_C        114U     /* TMR62_GCMC */
#define INT_SRC_TMR6_2_GCMP_D        115U     /* TMR62_GCMD */
#define INT_SRC_TMR6_2_GCMP_E        116U     /* TMR62_GCME */
#define INT_SRC_TMR6_2_GCMP_F        117U     /* TMR62_GCMF */
#define INT_SRC_TMR6_2_OVF           118U     /* TMR62_GOVF */
#define INT_SRC_TMR6_2_UDF           119U     /* TMR62_GUDF */
#define INT_SRC_TMR6_2_DTE           120U     /* TMR62_GDTE */
#define INT_SRC_TMR6_2_SCMP_A        123U     /* TMR62_SCMA */
#define INT_SRC_TMR6_2_SCMP_B        124U     /* TMR62_SCMB */
#define INT_SRC_TMR6_3_GCMP_A        128U     /* TMR63_GCMA */
#define INT_SRC_TMR6_3_GCMP_B        129U     /* TMR63_GCMB */
#define INT_SRC_TMR6_3_GCMP_C        130U     /* TMR63_GCMC */
#define INT_SRC_TMR6_3_GCMP_D        131U     /* TMR63_GCMD */
#define INT_SRC_TMR6_3_GCMP_E        132U     /* TMR63_GCME */
#define INT_SRC_TMR6_3_GCMP_F        133U     /* TMR63_GCMF */
#define INT_SRC_TMR6_3_OVF           134U     /* TMR63_GOVF */
#define INT_SRC_TMR6_3_UDF           135U     /* TMR63_GUDF */
#define INT_SRC_TMR6_3_DTE           136U     /* TMR63_GDTE */
#define INT_SRC_TMR6_3_SCMP_A        139U     /* TMR63_SCMA */
#define INT_SRC_TMR6_3_SCMP_B        140U     /* TMR63_SCMB */

/* TIMER A */
#define INT_SRC_TMRA_1_OVF           256U     /* TMRA1_OVF */
#define INT_SRC_TMRA_1_UDF           257U     /* TMRA1_UDF */
#define INT_SRC_TMRA_1_CMP           258U     /* TMRA1_CMP */
#define INT_SRC_TMRA_2_OVF           259U     /* TMRA2_OVF */
#define INT_SRC_TMRA_2_UDF           260U     /* TMRA2_UDF */
#define INT_SRC_TMRA_2_CMP           261U     /* TMRA2_CMP */
#define INT_SRC_TMRA_3_OVF           262U     /* TMRA3_OVF */
#define INT_SRC_TMRA_3_UDF           263U     /* TMRA3_UDF */
#define INT_SRC_TMRA_3_CMP           264U     /* TMRA3_CMP */
#define INT_SRC_TMRA_4_OVF           265U     /* TMRA4_OVF */
#define INT_SRC_TMRA_4_UDF           266U     /* TMRA4_UDF */
#define INT_SRC_TMRA_4_CMP           267U     /* TMRA4_CMP */
#define INT_SRC_TMRA_5_OVF           268U     /* TMRA5_OVF */
#define INT_SRC_TMRA_5_UDF           269U     /* TMRA5_UDF */
#define INT_SRC_TMRA_5_CMP           270U     /* TMRA5_CMP */
#define INT_SRC_TMRA_6_OVF           272U     /* TMRA6_OVF */
#define INT_SRC_TMRA_6_UDF           273U     /* TMRA6_UDF */
#define INT_SRC_TMRA_6_CMP           274U     /* TMRA6_CMP */

/* USB FS */
#define INT_SRC_USBFS_GLB            275U     /* USBFS_GLB */

/* USRAT */
#define INT_SRC_USART1_EI            278U     /* USART1_EI  */
#define INT_SRC_USART1_RI            279U     /* USART1_RI  */
#define INT_SRC_USART1_TI            280U     /* USART1_TI  */
#define INT_SRC_USART1_TCI           281U     /* USART1_TCI */
#define INT_SRC_USART1_RTO           282U     /* USART1_RTO */
#define INT_SRC_USART1_WUPI          432U     /* USART1_WUPI */
#define INT_SRC_USART2_EI            283U     /* USART2_EI  */
#define INT_SRC_USART2_RI            284U     /* USART2_RI  */
#define INT_SRC_USART2_TI            285U     /* USART2_TI  */
#define INT_SRC_USART2_TCI           286U     /* USART2_TCI */
#define INT_SRC_USART2_RTO           287U     /* USART2_RTO */
#define INT_SRC_USART3_EI            288U     /* USART3_EI  */
#define INT_SRC_USART3_RI            289U     /* USART3_RI  */
#define INT_SRC_USART3_TI            290U     /* USART3_TI  */
#define INT_SRC_USART3_TCI           291U     /* USART3_TCI */
#define INT_SRC_USART3_RTO           292U     /* USART3_RTO */
#define INT_SRC_USART4_EI            293U     /* USART4_EI  */
#define INT_SRC_USART4_RI            294U     /* USART4_RI  */
#define INT_SRC_USART4_TI            295U     /* USART4_TI  */
#define INT_SRC_USART4_TCI           296U     /* USART4_TCI */
#define INT_SRC_USART4_RTO           297U     /* USART4_RTO */

/* SPI */
#define INT_SRC_SPI1_SPRI            299U     /* SPI1_SPRI   */
#define INT_SRC_SPI1_SPTI            300U     /* SPI1_SPTI   */
#define INT_SRC_SPI1_SPII            301U     /* SPI1_SPII   */
#define INT_SRC_SPI1_SPEI            302U     /* SPI1_SPEI   */
#define INT_SRC_SPI2_SPRI            304U     /* SPI2_SPRI   */
#define INT_SRC_SPI2_SPTI            305U     /* SPI2_SPTI   */
#define INT_SRC_SPI2_SPII            306U     /* SPI2_SPII   */
#define INT_SRC_SPI2_SPEI            307U     /* SPI2_SPEI   */
#define INT_SRC_SPI3_SPRI            309U     /* SPI3_SPRI   */
#define INT_SRC_SPI3_SPTI            310U     /* SPI3_SPTI   */
#define INT_SRC_SPI3_SPII            311U     /* SPI3_SPII   */
#define INT_SRC_SPI3_SPEI            312U     /* SPI3_SPEI   */
#define INT_SRC_SPI4_SPRI            314U     /* SPI4_SPRI   */
#define INT_SRC_SPI4_SPTI            315U     /* SPI4_SPTI   */
#define INT_SRC_SPI4_SPII            316U     /* SPI4_SPII   */
#define INT_SRC_SPI4_SPEI            317U     /* SPI4_SPEI   */

/* TIMER 4 */
#define INT_SRC_TMR4_1_GCMP_UH       320U     /* TMR41_GCMUH */
#define INT_SRC_TMR4_1_GCMP_UL       321U     /* TMR41_GCMUL */
#define INT_SRC_TMR4_1_GCMP_VH       322U     /* TMR41_GCMVH */
#define INT_SRC_TMR4_1_GCMP_VL       323U     /* TMR41_GCMVL */
#define INT_SRC_TMR4_1_GCMP_WH       324U     /* TMR41_GCMWH */
#define INT_SRC_TMR4_1_GCMP_WL       325U     /* TMR41_GCMWL */
#define INT_SRC_TMR4_1_OVF           326U     /* TMR41_GOVF  */
#define INT_SRC_TMR4_1_UDF           327U     /* TMR41_GUDF  */
#define INT_SRC_TMR4_1_RELOAD_U      328U     /* TMR41_RLOU  */
#define INT_SRC_TMR4_1_RELOAD_V      329U     /* TMR41_RLOV  */
#define INT_SRC_TMR4_1_RELOAD_W      330U     /* TMR41_RLOW  */
#define INT_SRC_TMR4_2_GCMP_UH       336U     /* TMR42_GCMUH */
#define INT_SRC_TMR4_2_GCMP_UL       337U     /* TMR42_GCMUL */
#define INT_SRC_TMR4_2_GCMP_VH       338U     /* TMR42_GCMVH */
#define INT_SRC_TMR4_2_GCMP_VL       339U     /* TMR42_GCMVL */
#define INT_SRC_TMR4_2_GCMP_WH       340U     /* TMR42_GCMWH */
#define INT_SRC_TMR4_2_GCMP_WL       341U     /* TMR42_GCMWL */
#define INT_SRC_TMR4_2_OVF           342U     /* TMR42_GOVF  */
#define INT_SRC_TMR4_2_UDF           343U     /* TMR42_GUDF  */
#define INT_SRC_TMR4_2_RELOAD_U      344U     /* TMR42_RLOU  */
#define INT_SRC_TMR4_2_RELOAD_V      345U     /* TMR42_RLOV  */
#define INT_SRC_TMR4_2_RELOAD_W      346U     /* TMR42_RLOW  */
#define INT_SRC_TMR4_3_GCMP_UH       352U     /* TMR43_GCMUH */
#define INT_SRC_TMR4_3_GCMP_UL       353U     /* TMR43_GCMUL */
#define INT_SRC_TMR4_3_GCMP_VH       354U     /* TMR43_GCMVH */
#define INT_SRC_TMR4_3_GCMP_VL       355U     /* TMR43_GCMVL */
#define INT_SRC_TMR4_3_GCMP_WH       356U     /* TMR43_GCMWH */
#define INT_SRC_TMR4_3_GCMP_WL       357U     /* TMR43_GCMWL */
#define INT_SRC_TMR4_3_OVF           358U     /* TMR43_GOVF  */
#define INT_SRC_TMR4_3_UDF           359U     /* TMR43_GUDF  */
#define INT_SRC_TMR4_3_RELOAD_U      360U     /* TMR43_RLOU  */
#define INT_SRC_TMR4_3_RELOAD_V      361U     /* TMR43_RLOV  */
#define INT_SRC_TMR4_3_RELOAD_W      362U     /* TMR43_RLOW  */

/* EMB */
#define INT_SRC_EMB_GR0              390U     /* EMB_GR0  */
#define INT_SRC_EMB_GR1              391U     /* EMB_GR1  */
#define INT_SRC_EMB_GR2              392U     /* EMB_GR2  */
#define INT_SRC_EMB_GR3              393U     /* EMB_GR3  */

/* EVENT PORT */
#define INT_SRC_EVENT_PORT1          394U     /* EVENT_PORT1  */
#define INT_SRC_EVENT_PORT2          395U     /* EVENT_PORT2  */
#define INT_SRC_EVENT_PORT3          396U     /* EVENT_PORT3  */
#define INT_SRC_EVENT_PORT4          397U     /* EVENT_PORT4  */

/* I2S */
#define INT_SRC_I2S1_TXIRQOUT        400U     /* I2S1_TXIRQOUT */
#define INT_SRC_I2S1_RXIRQOUT        401U     /* I2S1_RXIRQOUT */
#define INT_SRC_I2S1_ERRIRQOUT       402U     /* I2S1_ERRIRQOUT */
#define INT_SRC_I2S2_TXIRQOUT        403U     /* I2S2_TXIRQOUT */
#define INT_SRC_I2S2_RXIRQOUT        404U     /* I2S2_RXIRQOUT */
#define INT_SRC_I2S2_ERRIRQOUT       405U     /* I2S2_ERRIRQOUT */
#define INT_SRC_I2S3_TXIRQOUT        406U     /* I2S3_TXIRQOUT */
#define INT_SRC_I2S3_RXIRQOUT        407U     /* I2S3_RXIRQOUT */
#define INT_SRC_I2S3_ERRIRQOUT       408U     /* I2S3_ERRIRQOUT */
#define INT_SRC_I2S4_TXIRQOUT        409U     /* I2S4_TXIRQOUT */
#define INT_SRC_I2S4_RXIRQOUT        410U     /* I2S4_RXIRQOUT */
#define INT_SRC_I2S4_ERRIRQOUT       411U     /* I2S4_ERRIRQOUT */

/* COMPARATOR */
#define INT_SRC_CMP1                 416U     /* ACMP1 */
#define INT_SRC_CMP2                 417U     /* ACMP2 */
#define INT_SRC_CMP3                 418U     /* ACMP3 */

/* I2C */
#define INT_SRC_I2C1_RXI             420U     /* I2C1_RXI */
#define INT_SRC_I2C1_TXI             421U     /* I2C1_TXI */
#define INT_SRC_I2C1_TEI             422U     /* I2C1_TEI */
#define INT_SRC_I2C1_EEI             423U     /* I2C1_EEI */
#define INT_SRC_I2C2_RXI             424U     /* I2C2_RXI */
#define INT_SRC_I2C2_TXI             425U     /* I2C2_TXI */
#define INT_SRC_I2C2_TEI             426U     /* I2C2_TEI */
#define INT_SRC_I2C2_EEI             427U     /* I2C2_EEI */
#define INT_SRC_I2C3_RXI             428U     /* I2C3_RXI */
#define INT_SRC_I2C3_TXI             429U     /* I2C3_TXI */
#define INT_SRC_I2C3_TEI             430U     /* I2C3_TEI */
#define INT_SRC_I2C3_EEI             431U     /* I2C3_EEI */

/* LVD */
#define INT_SRC_LVD1                 433U     /* LVD1 */
#define INT_SRC_LVD2                 434U     /* LVD2 */

/* Temp. sensor */
#define INT_SRC_OTS                  435U     /* OTS */

/* FCM */
#define INT_SRC_FCMFERRI             436U     /* FCMFERRI */
#define INT_SRC_FCMMENDI             437U     /* FCMMENDI */
#define INT_SRC_FCMCOVFI             438U     /* FCMCOVFI */

